[Survived] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:66:22
           isInvalid={Boolean(errors.reviewerId)}
           {...register("reviewerEmail", {
             required: "Reviewer Email is required.",
-            pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-              message: "Reviewer Email must be a valid email address.",
-            },
+            pattern: {},
           })}
         />

[Survived] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:68:24
             required: "Reviewer Email is required.",
             pattern: {
               value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
-              message: "Reviewer Email must be a valid email address.",
+              message: "",
             },
           })}

[Survived] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:85:18
           isInvalid={Boolean(errors.stars)}
           {...register("stars", {
             required: "Stars is required.",
-            min: {
-              value: 1,
-              message: "Stars must be at least 1.",
-            },
+            min: {},
             max: {
               value: 5,
