[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:65:24
           id="reviewerEmail"
           type="text"
           isInvalid={Boolean(errors.reviewerId)}
-          {...register("reviewerEmail", {
+          {...register("", {
             required: "Reviewer Email is required.",
             pattern: {
killedBy: MenuItemReviewForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.js:68:22
           {...register("reviewerEmail", {
             required: "Reviewer Email is required.",
             pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+              value: /^[^\s@]+@[^\s@]+\.[^\S@]+$/,
               message: "Reviewer Email must be a valid email address.",
             },
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /menuitemreview
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] Regex
main/components/MenuItemReview/MenuItemReviewForm.js:68:22
           {...register("reviewerEmail", {
             required: "Reviewer Email is required.",
             pattern: {
-              value: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
+              value: /^[^\s@]+@[^\s@]+\.[^\s@]+/,
               message: "Reviewer Email must be a valid email address.",
             },
killedBy: MenuItemReviewForm tests shows error for invalid email format
statusReason: Error: Unable to find an element with the text: /Reviewer Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
