[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/helprequests/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/helprequests/edit/1"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:38:5
   };
 
   const columns = [
-    {
-      Header: "Id",
-      accessor: "id", // accessor is the "key" in the data
-    },
+    {},
 
     {
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.js:47:5
       Header: "Requester Email",
       accessor: "requesterEmail",
     },
-    {
-      Header: "Team ID",
-      accessor: "teamId",
-    },
+    {},
     {
       Header: "Table or Breakout Room",
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:52:15
       accessor: "teamId",
     },
     {
-      Header: "Table or Breakout Room",
+      Header: "",
       accessor: "tableOrBreakoutRoom",
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Table or Breakout Room. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="tab

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:57:17
     },
     {
       Header: "Request Time (ISO)",
-      accessor: "requestTime",
+      accessor: "",
     },
     {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-requestTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
