[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.js:21:38
     },
   });
 
-  const onSuccess = (helprequest) => {
-    toast(
-      `New Help Request Created - id: ${helprequest.id} email: ${helprequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helprequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Help Request Created - id: 3 email: student@ucsb.edu"

Number of calls: 0

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:23:7
 
   const onSuccess = (helprequest) => {
     toast(
-      `New Help Request Created - id: ${helprequest.id} email: ${helprequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Help Request Created - id: 3 email: student@ucsb.edu"
Received: ""

Number of calls: 1
