[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:38:21
               message: "Max length 10 characters",
             },
           })}
-          disabled={disabledFields.orgCode || false}
+          disabled={true}
           isInvalid={Boolean(errors.orgCode)}
         />
killedBy: UCSBOrganizationForm tests shows error when orgCode exceeds max length
statusReason: Error: Unable to find an element with the text: /Max length 10 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.js:38:21
               message: "Max length 10 characters",
             },
           })}
-          disabled={disabledFields.orgCode || false}
+          disabled={disabledFields.orgCode && false}
           isInvalid={Boolean(errors.orgCode)}
         />
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided and orgCode is disabled
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <input class="form-control" data-testid="UCSBOrganizationForm-orgCode" id="orgCode" name="orgCode" type="text" />
