[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:50:5
       Header: "Org Translation",
       accessor: "orgTranslation",
     },
-    {
-      Header: "Inactive",
-      accessor: "inactive",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:53:37
     {
       Header: "Inactive",
       accessor: "inactive",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
+      Cell: ({ value }) => (value ? "" : "No"),
     },
   ];
killedBy: UCSBOrganizationTable tests renders 'Yes' or 'No' in the Inactive column
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:
