[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsborganization) => ({
-    url: "/api/ucsborganization",
-    method: "PUT",
-    params: {
-      orgCode: ucsborganization.orgCode,
-    },
-    data: {
-      orgCode: ucsborganization.orgCode,
-      orgTranslationShort: ucsborganization.orgTranslationShort,
-      orgTranslation: ucsborganization.orgTranslation,
-      inactive: ucsborganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsborganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided and orgCode is disabled
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSB Organization Updated - orgCode: RHA orgTranslationShort: Residence Halls Association orgTranslation: Residence Halls Association inactive: true"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSB Organization</h1>
-        {ucsborganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsborganization}
-            disabledFields={{ orgCode: true }}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided and orgCode is disabled
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSB Organization</h1>
-        {ucsborganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsborganization}
-            disabledFields={{ orgCode: true }}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided and orgCode is disabled
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:74:40
             submitAction={onSubmit}
             buttonLabel={"Update"}
             initialContents={ucsborganization}
-            disabledFields={{ orgCode: true }}
+            disabledFields={{ orgCode: false }}
           />
         )}
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided and orgCode is disabled
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <input class="form-control" data-testid="UCSBOrganizationForm-orgCode" id="orgCode" name="orgCode" type="text" />
