[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:31:35
           data-testid={testIdPrefix + "-orgCode"}
           id="orgCode"
           type="text"
-          {...register("orgCode", {
-            required: "Org Code is required.",
-            maxLength: {
-              value: 10,
-              message: "Max length 10 characters",
-            },
-          })}
+          {...register("orgCode", {})}
           // Stryker disable all
           defaultValue={initialContents?.orgCode || ""}
killedBy: UCSBOrganizationForm tests shows error when orgCode is missing
statusReason: Error: Unable to find an element with the text: /Org Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:35:24
             required: "Org Code is required.",
             maxLength: {
               value: 10,
-              message: "Max length 10 characters",
+              message: "",
             },
           })}
killedBy: UCSBOrganizationForm tests shows error when orgCode exceeds max length
statusReason: Error: Unable to find an element with the text: /Max length 10 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:41:21
           // Stryker disable all
           defaultValue={initialContents?.orgCode || ""}
           // Stryker restore all
-          disabled={disabledFields.orgCode || false} // Disable only if editing
+          disabled={true} // Disable only if editing
           isInvalid={Boolean(errors.orgCode)}
         />
killedBy: UCSBOrganizationForm tests shows error when orgCode exceeds max length
statusReason: Error: Unable to find an element with the text: /Max length 10 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:41:47
           // Stryker disable all
           defaultValue={initialContents?.orgCode || ""}
           // Stryker restore all
-          disabled={disabledFields.orgCode || false} // Disable only if editing
+          disabled={disabledFields.orgCode || true} // Disable only if editing
           isInvalid={Boolean(errors.orgCode)}
         />
killedBy: UCSBOrganizationForm tests shows error when orgCode exceeds max length
statusReason: Error: Unable to find an element with the text: /Max length 10 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:60:24
           isInvalid={Boolean(errors.orgTranslationShort)}
           {...register("orgTranslationShort", {
             required: "Org Translation Short is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationForm tests shows error when orgTranslationShort exceeds max length
statusReason: Error: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
