[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:50:5
       Header: "Org Translation",
       accessor: "orgTranslation",
     },
-    {
-      Header: "Inactive",
-      accessor: "inactive",
-      Cell: ({ value }) => (value ? "Yes" : "No"), // ✅ custom renderer
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:53:13
     {
       Header: "Inactive",
       accessor: "inactive",
-      Cell: ({ value }) => (value ? "Yes" : "No"), // ✅ custom renderer
+      Cell: () => undefined, // ✅ custom renderer
     },
   ];
killedBy: UCSBOrganizationTable tests renders 'Yes' or 'No' in the Inactive column
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:53:37
     {
       Header: "Inactive",
       accessor: "inactive",
-      Cell: ({ value }) => (value ? "Yes" : "No"), // ✅ custom renderer
+      Cell: ({ value }) => (value ? "" : "No"), // ✅ custom renderer
     },
   ];
killedBy: UCSBOrganizationTable tests renders 'Yes' or 'No' in the Inactive column
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Yes
Received:
