[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/ucsborganizations`,
-      params: {
-        orgCode, // Pass orgCode to the backend
-      },
+      params: {},
     },
   );
killedBy: UCSBOrganizationEditPage tests renders UCSBOrganizationTable with data
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganizations",
-    method: "PUT",
-    params: {
-      orgCode: ucsbOrganization.orgCode,
-    },
-    data: {
-      orgCode: ucsbOrganization.orgCode,
-      orgTranslationShort: ucsbOrganization.orgTranslationShort,
-      orgTranslation: ucsbOrganization.orgTranslation,
-      inactive: ucsbOrganization.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationEditPage tests calls mutate and invalidates correct cache key
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSB Organization</h1>
-        {ucsbOrganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsbOrganization}
-            disabledFields={{ orgCode: true }}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests renders UCSBOrganizationTable with data
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:68:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSB Organization</h1>
-        {ucsbOrganization && (
-          <UCSBOrganizationForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={ucsbOrganization}
-            disabledFields={{ orgCode: true }}
-          />
-        )}
+        {ucsbOrganization || <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbOrganization} disabledFields={{
+  orgCode: true
+}} />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests renders UCSBOrganizationTable with data
statusReason: Error: expect(element).toHaveValue(RHA)

Expected the element to have value:
  RHA
Received:

[Killed] BooleanLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:73:40
             submitAction={onSubmit}
             buttonLabel={"Update"}
             initialContents={ucsbOrganization}
-            disabledFields={{ orgCode: true }}
+            disabledFields={{ orgCode: false }}
           />
         )}
killedBy: UCSBOrganizationEditPage tests renders UCSBOrganizationTable with data
statusReason: Error: expect(element).toBeDisabled()

Received element is not disabled:
  <input class="form-control" data-testid="UCSBOrganizationForm-orgCode" id="orgCode" name="orgCode" type="text" value="RHA" />
