[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:54:46
               id="requestorEmail"
               type="text"
               isInvalid={Boolean(errors.requestorEmail)}
-              {...register("requestorEmail", {
-                required: "Requestor Email is required.",
-              })}
+              {...register("requestorEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Requestor Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:153:31
               label="Done"
               data-testid="RecommendationRequestForm-done"
               isInvalid={Boolean(errors.done)}
-              defaultChecked={initialContents?.done}
+              defaultChecked={initialContents.done}
               {...register("done", {
                 required: "Done is required.",
killedBy: RecommendationRequestForm tests renders correctly with no contents
statusReason: TypeError: Cannot read properties of undefined (reading 'done')
