[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:41:17
     },
     {
       Header: "Requestor Email",
-      accessor: "requestorEmail",
+      accessor: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-requestorEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:53:17
     },
     {
       Header: "Date Requested",
-      accessor: "dateRequested",
+      accessor: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-dateRequested"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:55:5
       Header: "Date Requested",
       accessor: "dateRequested",
     },
-    {
-      Header: "Date Needed",
-      accessor: "dateNeeded",
-    },
+    {},
     {
       Header: "Done",
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestTable.js:62:13
     {
       Header: "Done",
       accessor: "done",
-      Cell: ({ value }) => (value ? "Yes" : "No"),
+      Cell: () => undefined,
     },
   ];
killedBy: RecommendationRequestTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  No
Received:
