[Killed] ArrowFunction
src/main/utils/RecommendationRequestUtils.js:1:40
-export const cellToAxiosParamsDelete = (cell) => ({
-  url: "/api/recommendationrequest",
-  method: "DELETE",
-  params: {
-    id: cell.row.values.id,
-  },
-});
+export const cellToAxiosParamsDelete = () => undefined;
 
 export const onDeleteSuccess = (message) => {
killedBy: RecommendationRequestTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/RecommendationRequestUtils.js:1:51
-export const cellToAxiosParamsDelete = (cell) => ({
-  url: "/api/recommendationrequest",
-  method: "DELETE",
-  params: {
-    id: cell.row.values.id,
-  },
-});
+export const cellToAxiosParamsDelete = (cell) => ({});
 
 export const onDeleteSuccess = (message) => {
killedBy: RecommendationRequestTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:9:45
   },
 });
 
-export const onDeleteSuccess = (message) => {
-  console.log(message);
-};
+export const onDeleteSuccess = (message) => {};
 
killedBy: RecommendationRequestUtils onDeleteSuccess logs the message
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Test delete message"

Number of calls: 0
