[Killed] ArrowFunction
src/main/utils/RecommendationRequestUtils.js:1:40
-export const cellToAxiosParamsDelete = (cell) => ({
-  url: "/api/recommendation-requests/delete",
-  method: "DELETE",
-  params: {
-    id: cell.row.values.id,
-  },
-});
+export const cellToAxiosParamsDelete = () => undefined;
 
 export const onDeleteSuccess = (message) => {
killedBy: RecommendationRequestTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/RecommendationRequestUtils.js:1:51
-export const cellToAxiosParamsDelete = (cell) => ({
-  url: "/api/recommendation-requests/delete",
-  method: "DELETE",
-  params: {
-    id: cell.row.values.id,
-  },
-});
+export const cellToAxiosParamsDelete = (cell) => ({});
 
 export const onDeleteSuccess = (message) => {
killedBy: RecommendationRequestTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
