[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:33:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendation-requests/all"],
-    { method: "GET", url: "/api/recommendation-requests/all" },
+    { method: "", url: "/api/recommendation-requests/all" },
     [],
   );
killedBy: RecommendationRequestIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/recommendation-requests/all"
Received string:    "Error communicating with backend via  on /api/recommendation-requests/all"

[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.js:33:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendation-requests/all"],
-    { method: "GET", url: "/api/recommendation-requests/all" },
+    {},
     [],
   );
killedBy: RecommendationRequestIndexPage tests renders three recommendation requests correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
