[Killed] BlockStatement
src/main/utils/RecommendationRequestUtils.js:11:46
   },
 });
 
-export const onDeleteSuccess = (response) => {
-  console.log(response);
-  toast(response.message);
-};
+export const onDeleteSuccess = (response) => {};
 
killedBy: RecommendationRequestIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RecommendationRequest with id 2 deleted"

Number of calls: 0

Ignored nodes: comments, script, style
<html>
